zephyrproject-rtos/hal_nxp/dts/nxp/kinetis/kl2x/pinctrl/MKL27Z64VDA4-pinctrl.h
/*
 * NOTE: Autogenerated file by gen_soc_headers.py
 * for MKL27Z64VDA4/signal_configuration.xml
 *
 * Copyright 2024, NXP
 * SPDX-License-Identifier: Apache-2.0
 */

/*
 * Delta-deduplicated by dedup_pinctrl.py:
 * based on MKL27Z256VFM4-pinctrl.h with this part's differences applied
 * below (11 removed, 0 changed,
 * 56 added). Regenerate with dedup_pinctrl.py;
 * do not edit by hand.
 * target-hash: f81879510eea8536
 */

#ifndef _ZEPHYR_DTS_BINDING_MKL27Z64VDA4_WRAPPER_
#define _ZEPHYR_DTS_BINDING_MKL27Z64VDA4_WRAPPER_

#include "MKL27Z256VFM4-pinctrl.h"

/* Signals not present on this part */
#undef DAC0_OUT_PTE30
#undef I2S0_MCLK_PTC4
#undef I2S0_MCLK_PTC6
#undef I2S0_RXD0_PTC5
#undef I2S0_RX_BCLK_PTC6
#undef I2S0_RX_FS_PTC7
#undef I2S0_TXD0_PTC1
#undef I2S0_TX_BCLK_PTC3
#undef I2S0_TX_FS_PTC2
#undef SPI0_SS_PTC4
#undef SPI1_SS_PTD4

/* Signals specific to this part */
#define ADC0_DM0_PTE21 KINETIS_MUX('E',21,0)
#define ADC0_DM1_PTE17 KINETIS_MUX('E',17,0)
#define ADC0_DM3_PTE23 KINETIS_MUX('E',23,0)
#define ADC0_DP0_PTE20 KINETIS_MUX('E',20,0)
#define ADC0_DP1_PTE16 KINETIS_MUX('E',16,0)
#define ADC0_DP2_PTE18 KINETIS_MUX('E',18,0)
#define ADC0_DP3_PTE22 KINETIS_MUX('E',22,0)
#define ADC0_SE0_PTE20 KINETIS_MUX('E',20,0)
#define ADC0_SE1_PTE16 KINETIS_MUX('E',16,0)
#define ADC0_SE2_PTE18 KINETIS_MUX('E',18,0)
#define ADC0_SE3_PTE22 KINETIS_MUX('E',22,0)
#define ADC0_SE4a_PTE21 KINETIS_MUX('E',21,0)
#define ADC0_SE5a_PTE17 KINETIS_MUX('E',17,0)
#define ADC0_SE7a_PTE23 KINETIS_MUX('E',23,0)
#define FXIO0_D0_PTE16 KINETIS_MUX('E',16,6)
#define FXIO0_D1_PTE17 KINETIS_MUX('E',17,6)
#define FXIO0_D2_PTE18 KINETIS_MUX('E',18,6)
#define FXIO0_D4_PTE20 KINETIS_MUX('E',20,6)
#define FXIO0_D5_PTE21 KINETIS_MUX('E',21,6)
#define FXIO0_D6_PTE22 KINETIS_MUX('E',22,6)
#define FXIO0_D7_PTE23 KINETIS_MUX('E',23,6)
#define I2C0_SDA_PTE18 KINETIS_MUX('E',18,4)
#define I2C1_SCL_PTD7 KINETIS_MUX('D',7,4)
#define I2C1_SDA_PTD6 KINETIS_MUX('D',6,4)
#define LPTMR0_ALT3_PTE17 KINETIS_MUX('E',17,5)
#define LPUART0_RX_PTE21 KINETIS_MUX('E',21,4)
#define LPUART0_TX_PTE20 KINETIS_MUX('E',20,4)
#define PTE16 KINETIS_MUX('E',16,1)
#define PTE17 KINETIS_MUX('E',17,1)
#define PTE18 KINETIS_MUX('E',18,1)
#define PTE20 KINETIS_MUX('E',20,1)
#define PTE21 KINETIS_MUX('E',21,1)
#define PTE22 KINETIS_MUX('E',22,1)
#define PTE23 KINETIS_MUX('E',23,1)
#define SPI0_MISO_PTE18 KINETIS_MUX('E',18,5)
#define SPI0_MOSI_PTE18 KINETIS_MUX('E',18,2)
#define SPI0_PCS0_PTC4 KINETIS_MUX('C',4,2)
#define SPI0_PCS0_PTE16 KINETIS_MUX('E',16,2)
#define SPI0_SCK_PTE17 KINETIS_MUX('E',17,2)
#define SPI1_MISO_PTB0 KINETIS_MUX('B',0,5)
#define SPI1_MISO_PTB1 KINETIS_MUX('B',1,4)
#define SPI1_MOSI_PTB0 KINETIS_MUX('B',0,4)
#define SPI1_MOSI_PTB1 KINETIS_MUX('B',1,5)
#define SPI1_PCS0_PTC4 KINETIS_MUX('C',4,5)
#define SPI1_PCS0_PTD4 KINETIS_MUX('D',4,2)
#define TPM1_CH0_PTE20 KINETIS_MUX('E',20,3)
#define TPM1_CH1_PTE21 KINETIS_MUX('E',21,3)
#define TPM2_CH0_PTE22 KINETIS_MUX('E',22,3)
#define TPM2_CH1_PTE23 KINETIS_MUX('E',23,3)
#define TPM_CLKIN0_PTE16 KINETIS_MUX('E',16,4)
#define TPM_CLKIN1_PTE17 KINETIS_MUX('E',17,4)
#define UART2_RX_PTE17 KINETIS_MUX('E',17,3)
#define UART2_RX_PTE23 KINETIS_MUX('E',23,4)
#define UART2_TX_PTE16 KINETIS_MUX('E',16,3)
#define UART2_TX_PTE22 KINETIS_MUX('E',22,4)
#define VREF_OUT_PTE30 KINETIS_MUX('E',30,0)

#endif /* _ZEPHYR_DTS_BINDING_MKL27Z64VDA4_WRAPPER_ */
